------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/matthewspitzer/Desktop/EITC/Programs/30a.8_Regressions.log
  log type:  text
 opened on:   2 May 2023, 13:40:49

. 
. // bring in data
. use "/Users/matthewspitzer/Desktop/EITC/Output/cps00008_wide.dta", clear

. 
. // basic checks
. isid cpsidp

. tab treat,m

      treat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     13,684       97.16       97.16
          1 |        400        2.84      100.00
------------+-----------------------------------
      Total |     14,084      100.00

. 
. /*
> // create variable just for serial
> gen serial = substr(serial_pernum,1,5)
> */
. 
. // more missing value cleaning
. mvdecode adjginc??, mv(99999)
   adjginc93: 519 missing values generated
   adjginc94: 628 missing values generated

. foreach var of varlist adjginc?? {
  2.         replace `var' = . if `var' < 0
  3.         }
(0 real changes made)
(3 real changes made, 3 to missing)
(4 real changes made, 4 to missing)

. 
. // more restrictive treatment variable (otherside of max income for EITC)
. gen treat2 = treat

. replace treat2 = . if adjginc94 > `=39763 + (39763-37160)' & !mi(adjginc94)
(3269 real changes made, 3269 to missing)

. replace treat2 = . if adjginc94 < `=37160 - (39763-37160)' & treat==0 // just other side of range
(8862 real changes made, 8862 to missing)

. tab treat2

     treat2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,553       79.52       79.52
          1 |        400       20.48      100.00
------------+-----------------------------------
      Total |      1,953      100.00

. tablist treat treat2, s(v)

  +------------------------------------------------------+
  | treat   treat2   _Freq_   _Perc_   _CFreq_   _CPerc_ |
  |------------------------------------------------------|
  |     0        0     1553    11.03      1553     11.03 |
  |     0        .    12131    86.13     13684     97.16 |
  |     1        1      400     2.84     14084    100.00 |
  +------------------------------------------------------+

. 
. 
. // how many households
. distinct cpsid94 if treat2==1

         |        Observations
         |      total   distinct
---------+----------------------
 cpsid94 |        400        400

. distinct cpsid94 if treat2==0

         |        Observations
         |      total   distinct
---------+----------------------
 cpsid94 |       1553       1547

. 
. // by gender
. gen female94 = .
(14084 missing values generated)

. replace female94 = 1 if sex94==2
(7682 real changes made)

. replace female94 = 0 if sex94==1
(6402 real changes made)

. tablist treat2 female94 if !mi(treat2), s(v)

  +---------------------------------------------------------+
  | treat2   female94   _Freq_   _Perc_   _CFreq_   _CPerc_ |
  |---------------------------------------------------------|
  |      0          0     1322    67.69      1322     67.69 |
  |      0          1      231    11.83      1553     79.52 |
  |      1          0      295    15.10      1848     94.62 |
  |      1          1      105     5.38      1953    100.00 |
  +---------------------------------------------------------+

. 
. // by married
. gen married94 = .
(14084 missing values generated)

. replace married94 = 1 if inlist(marst94,1,2)
(13021 real changes made)

. replace married94 = 0 if !inlist(marst94,1,2)
(1063 real changes made)

. tablist treat2 married94 if !mi(treat2), s(v)

  +---------------------------------------------------------+
  | treat2   marri~94   _Freq_   _Perc_   _CFreq_   _CPerc_ |
  |---------------------------------------------------------|
  |      0          0      158     8.09       158      8.09 |
  |      0          1     1395    71.43      1553     79.52 |
  |      1          0      108     5.53      1661     85.05 |
  |      1          1      292    14.95      1953    100.00 |
  +---------------------------------------------------------+

. 
. // create outcome variables
. 
.         // hours worked (intensive margin)
.         gen hrs_worked94 = ahrsworkt94
(3303 missing values generated)

. 
.         // worked (extensive margin)
.         gen worked94 = 0

.         replace worked94 = 1 if !mi(hrs_worked94)
(10781 real changes made)

. 
. // basic regressions
. 
.         eststo clear

. 
.         // extensive margin
.         eststo: reg worked94 treat2, robust cluster(cpsid94)

Linear regression                                      Number of obs =    1953
                                                       F(  1,  1945) =    8.10
                                                       Prob > F      =  0.0045
                                                       R-squared     =  0.0050
                                                       Root MSE      =  .32882

                             (Std. Err. adjusted for 1946 clusters in cpsid94)
------------------------------------------------------------------------------
             |               Robust
    worked94 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      treat2 |  -.0579588   .0203629    -2.85   0.004    -.0978942   -.0180234
       _cons |   .8879588   .0079944   111.07   0.000     .8722802    .9036374
------------------------------------------------------------------------------
(est1 stored)

. 
.         // intensive margin
.         eststo: reg hrs_worked94 treat2, robust cluster(cpsid94)

Linear regression                                      Number of obs =    1711
                                                       F(  1,  1707) =   12.64
                                                       Prob > F      =  0.0004
                                                       R-squared     =  0.0080
                                                       Root MSE      =  12.849

                             (Std. Err. adjusted for 1708 clusters in cpsid94)
------------------------------------------------------------------------------
             |               Robust
hrs_worked94 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      treat2 |  -2.909944   .8185872    -3.55   0.000    -4.515484   -1.304404
       _cons |   45.48223     .34291   132.64   0.000     44.80967     46.1548
------------------------------------------------------------------------------
(est2 stored)

. 
. // only controlling for income  
.         local controls adjginc94 

. 
.         // extensive margin
.         eststo: reg worked94 treat2 `controls', robust cluster(cpsid94)

Linear regression                                      Number of obs =    1321
                                                       F(  2,  1314) =    3.10
                                                       Prob > F      =  0.0455
                                                       R-squared     =  0.0054
                                                       Root MSE      =  .35566

                             (Std. Err. adjusted for 1315 clusters in cpsid94)
------------------------------------------------------------------------------
             |               Robust
    worked94 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      treat2 |    .110623   .0673646     1.64   0.101    -.0215309    .2427769
   adjginc94 |   6.14e-06   2.84e-06     2.16   0.031     5.66e-07    .0000117
       _cons |   .6237394   .1105873     5.64   0.000     .4067925    .8406863
------------------------------------------------------------------------------
(est3 stored)

. 
.         // intensive margin
.         eststo: reg hrs_worked94 treat2 `controls', robust cluster(cpsid94)

Linear regression                                      Number of obs =    1124
                                                       F(  2,  1120) =    1.22
                                                       Prob > F      =  0.2970
                                                       R-squared     =  0.0027
                                                       Root MSE      =  12.191

                             (Std. Err. adjusted for 1121 clusters in cpsid94)
------------------------------------------------------------------------------
             |               Robust
hrs_worked94 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      treat2 |   1.281174   2.470341     0.52   0.604    -3.565842    6.128191
   adjginc94 |   .0001056   .0001067     0.99   0.323    -.0001038     .000315
       _cons |   39.62583   4.126892     9.60   0.000     31.52852    47.72314
------------------------------------------------------------------------------
(est4 stored)

. 
.         esttab, tex se

{
\def\sym#1{\ifmmode^{#1}\else\(^{#1}\)\fi}
\begin{tabular}{l*{4}{c}}
\hline\hline
            &\multicolumn{1}{c}{(1)}&\multicolumn{1}{c}{(2)}&\multicolumn{1}{c}{(3)}&\multicolumn{1}{c}{(4)}\\
            &\multicolumn{1}{c}{worked94}&\multicolumn{1}{c}{hrs\_worked94}&\multicolumn{1}{c}{worked94}&\multicolumn{1}{c}{hrs\_worked94}\\
\hline
treat2      &     -0.0580\sym{**} &      -2.910\sym{***}&       0.111         &       1.281         \\
            &    (0.0204)         &     (0.819)         &    (0.0674)         &     (2.470)         \\
[1em]
adjginc94   &                     &                     &  0.00000614\sym{*}  &    0.000106         \\
            &                     &                     &(0.00000284)         &  (0.000107)         \\
[1em]
\_cons      &       0.888\sym{***}&       45.48\sym{***}&       0.624\sym{***}&       39.63\sym{***}\\
            &   (0.00799)         &     (0.343)         &     (0.111)         &     (4.127)         \\
\hline
\(N\)       &        1953         &        1711         &        1321         &        1124         \\
\hline\hline
\multicolumn{5}{l}{\footnotesize Standard errors in parentheses}\\
\multicolumn{5}{l}{\footnotesize \sym{*} \(p<0.05\), \sym{**} \(p<0.01\), \sym{***} \(p<0.001\)}\\
\end{tabular}
}

.         esttab, se

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                 worked94    hrs_worked94        worked94    hrs_worked94   
----------------------------------------------------------------------------
treat2            -0.0580**        -2.910***        0.111           1.281   
                 (0.0204)         (0.819)        (0.0674)         (2.470)   

adjginc94                                      0.00000614*       0.000106   
                                             (0.00000284)      (0.000107)   

_cons               0.888***        45.48***        0.624***        39.63***
                (0.00799)         (0.343)         (0.111)         (4.127)   
----------------------------------------------------------------------------
N                    1953            1711            1321            1124   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

.         
. // with all controls
.         local controls adjginc94 female94 married94 nchild94

. 
.         eststo clear

. 
.         // extensive margin
.         eststo: reg worked94 treat2 `controls', robust cluster(cpsid94)

Linear regression                                      Number of obs =    1321
                                                       F(  5,  1314) =   11.32
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0426
                                                       Root MSE      =  .34935

                             (Std. Err. adjusted for 1315 clusters in cpsid94)
------------------------------------------------------------------------------
             |               Robust
    worked94 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      treat2 |   .1367179   .0653901     2.09   0.037     .0084376    .2649982
   adjginc94 |   7.92e-06   2.76e-06     2.87   0.004     2.51e-06    .0000133
    female94 |  -.1421611   .0359417    -3.96   0.000    -.2126706   -.0716516
   married94 |  -.2138844   .0329914    -6.48   0.000     -.278606   -.1491628
    nchild94 |   .0301149   .0099878     3.02   0.003      .010521    .0497087
       _cons |   .7066868   .1125811     6.28   0.000     .4858285     .927545
------------------------------------------------------------------------------
(est1 stored)

. 
.         // intensive margin
.         eststo: reg hrs_worked94 treat2 `controls', robust cluster(cpsid94)

Linear regression                                      Number of obs =    1124
                                                       F(  5,  1120) =    8.45
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0393
                                                       Root MSE      =  11.981

                             (Std. Err. adjusted for 1121 clusters in cpsid94)
------------------------------------------------------------------------------
             |               Robust
hrs_worked94 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      treat2 |   1.600669   2.454283     0.65   0.514    -3.214842     6.41618
   adjginc94 |   .0001048   .0001079     0.97   0.332    -.0001069    .0003166
    female94 |  -5.951374   1.417223    -4.20   0.000    -8.732086   -3.170663
   married94 |  -1.512541   1.388876    -1.09   0.276    -4.237632     1.21255
    nchild94 |   1.047757   .3967919     2.64   0.008     .2692177    1.826296
       _cons |   39.98652   4.279541     9.34   0.000      31.5897    48.38335
------------------------------------------------------------------------------
(est2 stored)

. 
.         esttab, tex se

{
\def\sym#1{\ifmmode^{#1}\else\(^{#1}\)\fi}
\begin{tabular}{l*{2}{c}}
\hline\hline
            &\multicolumn{1}{c}{(1)}&\multicolumn{1}{c}{(2)}\\
            &\multicolumn{1}{c}{worked94}&\multicolumn{1}{c}{hrs\_worked94}\\
\hline
treat2      &       0.137\sym{*}  &       1.601         \\
            &    (0.0654)         &     (2.454)         \\
[1em]
adjginc94   &  0.00000792\sym{**} &    0.000105         \\
            &(0.00000276)         &  (0.000108)         \\
[1em]
female94    &      -0.142\sym{***}&      -5.951\sym{***}\\
            &    (0.0359)         &     (1.417)         \\
[1em]
married94   &      -0.214\sym{***}&      -1.513         \\
            &    (0.0330)         &     (1.389)         \\
[1em]
nchild94    &      0.0301\sym{**} &       1.048\sym{**} \\
            &   (0.00999)         &     (0.397)         \\
[1em]
\_cons      &       0.707\sym{***}&       39.99\sym{***}\\
            &     (0.113)         &     (4.280)         \\
\hline
\(N\)       &        1321         &        1124         \\
\hline\hline
\multicolumn{3}{l}{\footnotesize Standard errors in parentheses}\\
\multicolumn{3}{l}{\footnotesize \sym{*} \(p<0.05\), \sym{**} \(p<0.01\), \sym{***} \(p<0.001\)}\\
\end{tabular}
}

.         esttab, se

--------------------------------------------
                      (1)             (2)   
                 worked94    hrs_worked94   
--------------------------------------------
treat2              0.137*          1.601   
                 (0.0654)         (2.454)   

adjginc94      0.00000792**      0.000105   
             (0.00000276)      (0.000108)   

female94           -0.142***       -5.951***
                 (0.0359)         (1.417)   

married94          -0.214***       -1.513   
                 (0.0330)         (1.389)   

nchild94           0.0301**         1.048** 
                (0.00999)         (0.397)   

_cons               0.707***        39.99***
                  (0.113)         (4.280)   
--------------------------------------------
N                    1321            1124   
--------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. // females only
. preserve

. keep if female == 1
(6402 observations deleted)

. 
. // basic regressions
. 
.         eststo clear

. 
.         // extensive margin
.         eststo: reg worked94 treat2, robust cluster(cpsid94)

Linear regression                                      Number of obs =     336
                                                       F(  1,   331) =    0.31
                                                       Prob > F      =  0.5785
                                                       R-squared     =  0.0009
                                                       Root MSE      =  .38397

                              (Std. Err. adjusted for 332 clusters in cpsid94)
------------------------------------------------------------------------------
             |               Robust
    worked94 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      treat2 |   .0242424   .0435911     0.56   0.578    -.0615081     .109993
       _cons |   .8138528   .0256258    31.76   0.000     .7634429    .8642627
------------------------------------------------------------------------------
(est1 stored)

. 
.         // intensive margin
.         eststo: reg hrs_worked94 treat2, robust cluster(cpsid94)

Linear regression                                      Number of obs =     276
                                                       F(  1,   273) =    0.02
                                                       Prob > F      =  0.8998
                                                       R-squared     =  0.0001
                                                       Root MSE      =  12.467

                              (Std. Err. adjusted for 274 clusters in cpsid94)
------------------------------------------------------------------------------
             |               Robust
hrs_worked94 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      treat2 |  -.1924565   1.527015    -0.13   0.900    -3.198678    2.813765
       _cons |   39.26064   .9885306    39.72   0.000     37.31453    41.20675
------------------------------------------------------------------------------
(est2 stored)

. 
. 
. // only controlling for income  
.         local controls adjginc94 

. 
.         // extensive margin
.         eststo: reg worked94 treat2 `controls', robust cluster(cpsid94)

Linear regression                                      Number of obs =     276
                                                       F(  2,   272) =    0.57
                                                       Prob > F      =  0.5675
                                                       R-squared     =  0.0045
                                                       Root MSE      =  .38026

                              (Std. Err. adjusted for 273 clusters in cpsid94)
------------------------------------------------------------------------------
             |               Robust
    worked94 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      treat2 |   .1515672   .1426517     1.06   0.289    -.1292746    .4324089
   adjginc94 |   5.79e-06   5.92e-06     0.98   0.329    -5.86e-06    .0000174
       _cons |   .5972264   .2302724     2.59   0.010     .1438835    1.050569
------------------------------------------------------------------------------
(est3 stored)

. 
.         // intensive margin
.         eststo: reg hrs_worked94 treat2 `controls', robust cluster(cpsid94)

Linear regression                                      Number of obs =     228
                                                       F(  2,   225) =    1.05
                                                       Prob > F      =  0.3511
                                                       R-squared     =  0.0063
                                                       Root MSE      =  12.096

                              (Std. Err. adjusted for 226 clusters in cpsid94)
------------------------------------------------------------------------------
             |               Robust
hrs_worked94 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      treat2 |  -5.521759   3.890465    -1.42   0.157    -13.18817    2.144648
   adjginc94 |    -.00024   .0001694    -1.42   0.158    -.0005738    .0000937
       _cons |   48.32642   6.534641     7.40   0.000     35.44949    61.20334
------------------------------------------------------------------------------
(est4 stored)

. 
.         esttab, tex se

{
\def\sym#1{\ifmmode^{#1}\else\(^{#1}\)\fi}
\begin{tabular}{l*{4}{c}}
\hline\hline
            &\multicolumn{1}{c}{(1)}&\multicolumn{1}{c}{(2)}&\multicolumn{1}{c}{(3)}&\multicolumn{1}{c}{(4)}\\
            &\multicolumn{1}{c}{worked94}&\multicolumn{1}{c}{hrs\_worked94}&\multicolumn{1}{c}{worked94}&\multicolumn{1}{c}{hrs\_worked94}\\
\hline
treat2      &      0.0242         &      -0.192         &       0.152         &      -5.522         \\
            &    (0.0436)         &     (1.527)         &     (0.143)         &     (3.890)         \\
[1em]
adjginc94   &                     &                     &  0.00000579         &   -0.000240         \\
            &                     &                     &(0.00000592)         &  (0.000169)         \\
[1em]
\_cons      &       0.814\sym{***}&       39.26\sym{***}&       0.597\sym{*}  &       48.33\sym{***}\\
            &    (0.0256)         &     (0.989)         &     (0.230)         &     (6.535)         \\
\hline
\(N\)       &         336         &         276         &         276         &         228         \\
\hline\hline
\multicolumn{5}{l}{\footnotesize Standard errors in parentheses}\\
\multicolumn{5}{l}{\footnotesize \sym{*} \(p<0.05\), \sym{**} \(p<0.01\), \sym{***} \(p<0.001\)}\\
\end{tabular}
}

.         esttab, se

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                 worked94    hrs_worked94        worked94    hrs_worked94   
----------------------------------------------------------------------------
treat2             0.0242          -0.192           0.152          -5.522   
                 (0.0436)         (1.527)         (0.143)         (3.890)   

adjginc94                                      0.00000579       -0.000240   
                                             (0.00000592)      (0.000169)   

_cons               0.814***        39.26***        0.597*          48.33***
                 (0.0256)         (0.989)         (0.230)         (6.535)   
----------------------------------------------------------------------------
N                     336             276             276             228   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

.         
. // with all controls
.         local controls adjginc94 married94 nchild94

. 
.         eststo clear

. 
.         // extensive margin
.         eststo: reg worked94 treat2 `controls', robust cluster(cpsid94)

Linear regression                                      Number of obs =     276
                                                       F(  4,   272) =   11.71
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1726
                                                       Root MSE      =  .34794

                              (Std. Err. adjusted for 273 clusters in cpsid94)
------------------------------------------------------------------------------
             |               Robust
    worked94 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      treat2 |   .2415954   .1270749     1.90   0.058      -.00858    .4917708
   adjginc94 |   .0000108   5.31e-06     2.03   0.044     3.03e-07    .0000212
   married94 |  -.3153125   .0522336    -6.04   0.000    -.4181461   -.2124789
    nchild94 |  -.0292764   .0265147    -1.10   0.271    -.0814766    .0229237
       _cons |   .5796149   .2217297     2.61   0.009     .1430902     1.01614
------------------------------------------------------------------------------
(est1 stored)

. 
.         // intensive margin
.         eststo: reg hrs_worked94 treat2 `controls', robust cluster(cpsid94)

Linear regression                                      Number of obs =     228
                                                       F(  4,   225) =    2.69
                                                       Prob > F      =  0.0319
                                                       R-squared     =  0.0566
                                                       Root MSE      =  11.839

                              (Std. Err. adjusted for 226 clusters in cpsid94)
------------------------------------------------------------------------------
             |               Robust
hrs_worked94 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      treat2 |  -4.358004   3.753838    -1.16   0.247    -11.75518    3.039171
   adjginc94 |   -.000165   .0001619    -1.02   0.309    -.0004841     .000154
   married94 |  -5.832969   2.113866    -2.76   0.006    -9.998476   -1.667463
    nchild94 |  -.9039992   .8879605    -1.02   0.310    -2.653782    .8457832
       _cons |   48.76006   6.529504     7.47   0.000     35.89326    61.62687
------------------------------------------------------------------------------
(est2 stored)

. 
.         esttab, tex se

{
\def\sym#1{\ifmmode^{#1}\else\(^{#1}\)\fi}
\begin{tabular}{l*{2}{c}}
\hline\hline
            &\multicolumn{1}{c}{(1)}&\multicolumn{1}{c}{(2)}\\
            &\multicolumn{1}{c}{worked94}&\multicolumn{1}{c}{hrs\_worked94}\\
\hline
treat2      &       0.242         &      -4.358         \\
            &     (0.127)         &     (3.754)         \\
[1em]
adjginc94   &   0.0000108\sym{*}  &   -0.000165         \\
            &(0.00000531)         &  (0.000162)         \\
[1em]
married94   &      -0.315\sym{***}&      -5.833\sym{**} \\
            &    (0.0522)         &     (2.114)         \\
[1em]
nchild94    &     -0.0293         &      -0.904         \\
            &    (0.0265)         &     (0.888)         \\
[1em]
\_cons      &       0.580\sym{**} &       48.76\sym{***}\\
            &     (0.222)         &     (6.530)         \\
\hline
\(N\)       &         276         &         228         \\
\hline\hline
\multicolumn{3}{l}{\footnotesize Standard errors in parentheses}\\
\multicolumn{3}{l}{\footnotesize \sym{*} \(p<0.05\), \sym{**} \(p<0.01\), \sym{***} \(p<0.001\)}\\
\end{tabular}
}

.         esttab, se

--------------------------------------------
                      (1)             (2)   
                 worked94    hrs_worked94   
--------------------------------------------
treat2              0.242          -4.358   
                  (0.127)         (3.754)   

adjginc94       0.0000108*      -0.000165   
             (0.00000531)      (0.000162)   

married94          -0.315***       -5.833** 
                 (0.0522)         (2.114)   

nchild94          -0.0293          -0.904   
                 (0.0265)         (0.888)   

_cons               0.580**         48.76***
                  (0.222)         (6.530)   
--------------------------------------------
N                     276             228   
--------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. restore

. 
. cap log close
