---------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/matthewspitzer/Desktop/EITC/Programs/35a.10_DiDRegressions.log
  log type:  text
 opened on:   2 May 2023, 19:19:50

. 
. // bring in data
. use "/Users/matthewspitzer/Desktop/EITC/Output/cps00010_did.dta", clear

. 
. // basic checks
. isid year cpsidp

. tab treat,m

      treat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        364       48.15       48.15
          1 |        392       51.85      100.00
------------+-----------------------------------
      Total |        756      100.00

. 
. /*
> // create variable just for serial
> gen serial = substr(serial_pernum,1,5)
> */
. 
. // more missing value cleaning
. mvdecode adjginc??, mv(99999)

. foreach var of varlist adjginc?? {
  2.         replace `var' = . if `var' < 0
  3.         }
(0 real changes made)

. 
. // how many households
. distinct cpsid if treat==1

       |        Observations
       |      total   distinct
-------+----------------------
 cpsid |        392        196

. distinct cpsid if treat==0

       |        Observations
       |      total   distinct
-------+----------------------
 cpsid |        364        182

. 
. // by gender
. gen female = .
(756 missing values generated)

. replace female = 1 if sex==2
(208 real changes made)

. replace female = 0 if sex==1
(548 real changes made)

. tablist treat female if !mi(treat), s(v)

  +------------------------------------------------------+
  | treat   female   _Freq_   _Perc_   _CFreq_   _CPerc_ |
  |------------------------------------------------------|
  |     0        0      275    36.38       275     36.38 |
  |     0        1       89    11.77       364     48.15 |
  |     1        0      273    36.11       637     84.26 |
  |     1        1      119    15.74       756    100.00 |
  +------------------------------------------------------+

. 
. // by married
. gen married = .
(756 missing values generated)

. replace married = 1 if inlist(marst,1,2)
(558 real changes made)

. replace married = 0 if !inlist(marst,1,2)
(198 real changes made)

. tablist treat married if !mi(treat), s(v)

  +-------------------------------------------------------+
  | treat   married   _Freq_   _Perc_   _CFreq_   _CPerc_ |
  |-------------------------------------------------------|
  |     0         0       79    10.45        79     10.45 |
  |     0         1      285    37.70       364     48.15 |
  |     1         0      119    15.74       483     63.89 |
  |     1         1      273    36.11       756    100.00 |
  +-------------------------------------------------------+

. 
. // create outcome variables
. 
.         // hours worked (intensive margin)
.         gen hrs_worked = ahrsworkt
(147 missing values generated)

. 
.         // worked (extensive margin)
.         gen worked = 0

.         replace worked = 1 if !mi(hrs_worked)
(609 real changes made)

. 
. // create interaction term
. gen treat_x_post = treat*post

.         
. // basic regressions
. 
.         eststo clear

. 
.         // extensive margin
.         eststo: reg worked treat post treat_x_post, robust cluster(cpsid)

Linear regression                                      Number of obs =     756
                                                       F(  3,   376) =    0.24
                                                       Prob > F      =  0.8702
                                                       R-squared     =  0.0005
                                                       Root MSE      =  .39672

                                (Std. Err. adjusted for 377 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
      worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .0035322   .0406725     0.09   0.931    -.0764419    .0835062
        post |   .0054945   .0264352     0.21   0.835    -.0464848    .0574738
treat_x_post |  -.0259027   .0371058    -0.70   0.486    -.0988636    .0470582
       _cons |   .8076923   .0293107    27.56   0.000     .7500588    .8653258
------------------------------------------------------------------------------
(est1 stored)

. 
.         // intensive margin
.         eststo: reg hrs_worked  treat post treat_x_post, robust cluster(cpsid)

Linear regression                                      Number of obs =     609
                                                       F(  3,   327) =    1.57
                                                       Prob > F      =  0.1971
                                                       R-squared     =  0.0038
                                                       Root MSE      =  13.515

                                (Std. Err. adjusted for 328 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
  hrs_worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1.085355   1.552272     0.70   0.485    -1.968345    4.139055
        post |  -.2158945   1.139059    -0.19   0.850    -2.456703    2.024914
treat_x_post |  -2.079906    1.55878    -1.33   0.183    -5.146408    .9865964
       _cons |   43.95238   1.158617    37.94   0.000      41.6731    46.23167
------------------------------------------------------------------------------
(est2 stored)

.         
. 
. // only controlling for income  
.         local controls adjginc 

. 
.         // extensive margin
.         eststo: reg worked treat post treat_x_post `controls', robust cluster(cpsid)

Linear regression                                      Number of obs =     756
                                                       F(  4,   376) =    0.38
                                                       Prob > F      =  0.8250
                                                       R-squared     =  0.0021
                                                       Root MSE      =  .39668

                                (Std. Err. adjusted for 377 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
      worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .0063328   .0407356     0.16   0.877    -.0737653     .086431
        post |   .0149663   .0284533     0.53   0.599    -.0409813    .0709138
treat_x_post |  -.0264078   .0369752    -0.71   0.476    -.0991118    .0462963
     adjginc |   1.48e-06   1.54e-06     0.97   0.334    -1.54e-06    4.50e-06
       _cons |   .7596575   .0584637    12.99   0.000     .6447007    .8746143
------------------------------------------------------------------------------
(est3 stored)

. 
.         // intensive margin
.         eststo: reg hrs_worked treat post treat_x_post `controls', robust cluster(cpsid)

Linear regression                                      Number of obs =     609
                                                       F(  4,   327) =    1.20
                                                       Prob > F      =  0.3127
                                                       R-squared     =  0.0039
                                                       Root MSE      =  13.525

                                (Std. Err. adjusted for 328 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
  hrs_worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1.110219   1.558784     0.71   0.477     -1.95629    4.176729
        post |  -.1153185   1.197539    -0.10   0.923     -2.47117    2.240533
treat_x_post |  -2.081213    1.56239    -1.33   0.184    -5.154818    .9923919
     adjginc |   .0000153   .0000552     0.28   0.782    -.0000933    .0001239
       _cons |   43.45341   2.154208    20.17   0.000     39.21556    47.69126
------------------------------------------------------------------------------
(est4 stored)

. 
.         esttab, tex se

{
\def\sym#1{\ifmmode^{#1}\else\(^{#1}\)\fi}
\begin{tabular}{l*{4}{c}}
\hline\hline
            &\multicolumn{1}{c}{(1)}&\multicolumn{1}{c}{(2)}&\multicolumn{1}{c}{(3)}&\multicolumn{1}{c}{(4)}\\
            &\multicolumn{1}{c}{worked}&\multicolumn{1}{c}{hrs\_worked}&\multicolumn{1}{c}{worked}&\multicolumn{1}{c}{hrs\_
> worked}\\
\hline
treat       &     0.00353         &       1.085         &     0.00633         &       1.110         \\
            &    (0.0407)         &     (1.552)         &    (0.0407)         &     (1.559)         \\
[1em]
post        &     0.00549         &      -0.216         &      0.0150         &      -0.115         \\
            &    (0.0264)         &     (1.139)         &    (0.0285)         &     (1.198)         \\
[1em]
treat\_x\_post&     -0.0259         &      -2.080         &     -0.0264         &      -2.081         \\
            &    (0.0371)         &     (1.559)         &    (0.0370)         &     (1.562)         \\
[1em]
adjginc     &                     &                     &  0.00000148         &   0.0000153         \\
            &                     &                     &(0.00000154)         & (0.0000552)         \\
[1em]
\_cons      &       0.808\sym{***}&       43.95\sym{***}&       0.760\sym{***}&       43.45\sym{***}\\
            &    (0.0293)         &     (1.159)         &    (0.0585)         &     (2.154)         \\
\hline
\(N\)       &         756         &         609         &         756         &         609         \\
\hline\hline
\multicolumn{5}{l}{\footnotesize Standard errors in parentheses}\\
\multicolumn{5}{l}{\footnotesize \sym{*} \(p<0.05\), \sym{**} \(p<0.01\), \sym{***} \(p<0.001\)}\\
\end{tabular}
}

.         esttab, se

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                   worked      hrs_worked          worked      hrs_worked   
----------------------------------------------------------------------------
treat             0.00353           1.085         0.00633           1.110   
                 (0.0407)         (1.552)        (0.0407)         (1.559)   

post              0.00549          -0.216          0.0150          -0.115   
                 (0.0264)         (1.139)        (0.0285)         (1.198)   

treat_x_post      -0.0259          -2.080         -0.0264          -2.081   
                 (0.0371)         (1.559)        (0.0370)         (1.562)   

adjginc                                        0.00000148       0.0000153   
                                             (0.00000154)     (0.0000552)   

_cons               0.808***        43.95***        0.760***        43.45***
                 (0.0293)         (1.159)        (0.0585)         (2.154)   
----------------------------------------------------------------------------
N                     756             609             756             609   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

.         
. // with all controls
.         local controls adjginc female married nchild less_hi_schl

. 
.         eststo clear

. 
.         // extensive margin
.         eststo: reg worked treat post treat_x_post `controls', robust cluster(cpsid)

Linear regression                                      Number of obs =     756
                                                       F(  8,   376) =    4.88
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0623
                                                       Root MSE      =  .38554

                                (Std. Err. adjusted for 377 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
      worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   -.004747   .0393343    -0.12   0.904    -.0820898    .0725959
        post |   .0162747   .0284944     0.57   0.568    -.0397536     .072303
treat_x_post |   -.028782   .0373528    -0.77   0.441    -.1022286    .0446646
     adjginc |   1.75e-06   1.45e-06     1.20   0.229    -1.11e-06    4.61e-06
      female |  -.1508789   .0586886    -2.57   0.011    -.2662778   -.0354799
     married |  -.2777792   .0547936    -5.07   0.000    -.3855195    -.170039
      nchild |   .0166069   .0175086     0.95   0.343    -.0178202     .051034
less_hi_schl |  -.0669815   .0561429    -1.19   0.234    -.1773749    .0434119
       _cons |   .9863274   .0804025    12.27   0.000     .8282325    1.144422
------------------------------------------------------------------------------
(est1 stored)

. 
.         // intensive margin
.         eststo: reg hrs_worked treat post treat_x_post `controls', robust cluster(cpsid)

Linear regression                                      Number of obs =     609
                                                       F(  8,   327) =    4.37
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0419
                                                       Root MSE      =  13.309

                                (Std. Err. adjusted for 328 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
  hrs_worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1.568345   1.532197     1.02   0.307    -1.445863    4.582552
        post |  -.3013616   1.199793    -0.25   0.802    -2.661648    2.058925
treat_x_post |  -2.042032   1.567426    -1.30   0.194    -5.125543    1.041478
     adjginc |  -.0000118   .0000529    -0.22   0.824    -.0001158    .0000922
      female |  -4.847123   1.812278    -2.67   0.008    -8.412317   -1.281928
     married |     -.4092   1.730142    -0.24   0.813    -3.812814    2.994414
      nchild |  -.0124393   .6266931    -0.02   0.984    -1.245298     1.22042
less_hi_schl |  -5.177544   1.339578    -3.87   0.000    -7.812821   -2.542266
       _cons |   46.45484   2.512564    18.49   0.000     41.51201    51.39766
------------------------------------------------------------------------------
(est2 stored)

. 
.         esttab, tex se

{
\def\sym#1{\ifmmode^{#1}\else\(^{#1}\)\fi}
\begin{tabular}{l*{2}{c}}
\hline\hline
            &\multicolumn{1}{c}{(1)}&\multicolumn{1}{c}{(2)}\\
            &\multicolumn{1}{c}{worked}&\multicolumn{1}{c}{hrs\_worked}\\
\hline
treat       &    -0.00475         &       1.568         \\
            &    (0.0393)         &     (1.532)         \\
[1em]
post        &      0.0163         &      -0.301         \\
            &    (0.0285)         &     (1.200)         \\
[1em]
treat\_x\_post&     -0.0288         &      -2.042         \\
            &    (0.0374)         &     (1.567)         \\
[1em]
adjginc     &  0.00000175         &  -0.0000118         \\
            &(0.00000145)         & (0.0000529)         \\
[1em]
female      &      -0.151\sym{*}  &      -4.847\sym{**} \\
            &    (0.0587)         &     (1.812)         \\
[1em]
married     &      -0.278\sym{***}&      -0.409         \\
            &    (0.0548)         &     (1.730)         \\
[1em]
nchild      &      0.0166         &     -0.0124         \\
            &    (0.0175)         &     (0.627)         \\
[1em]
less\_hi\_schl&     -0.0670         &      -5.178\sym{***}\\
            &    (0.0561)         &     (1.340)         \\
[1em]
\_cons      &       0.986\sym{***}&       46.45\sym{***}\\
            &    (0.0804)         &     (2.513)         \\
\hline
\(N\)       &         756         &         609         \\
\hline\hline
\multicolumn{3}{l}{\footnotesize Standard errors in parentheses}\\
\multicolumn{3}{l}{\footnotesize \sym{*} \(p<0.05\), \sym{**} \(p<0.01\), \sym{***} \(p<0.001\)}\\
\end{tabular}
}

.         esttab, se

--------------------------------------------
                      (1)             (2)   
                   worked      hrs_worked   
--------------------------------------------
treat            -0.00475           1.568   
                 (0.0393)         (1.532)   

post               0.0163          -0.301   
                 (0.0285)         (1.200)   

treat_x_post      -0.0288          -2.042   
                 (0.0374)         (1.567)   

adjginc        0.00000175      -0.0000118   
             (0.00000145)     (0.0000529)   

female             -0.151*         -4.847** 
                 (0.0587)         (1.812)   

married            -0.278***       -0.409   
                 (0.0548)         (1.730)   

nchild             0.0166         -0.0124   
                 (0.0175)         (0.627)   

less_hi_schl      -0.0670          -5.178***
                 (0.0561)         (1.340)   

_cons               0.986***        46.45***
                 (0.0804)         (2.513)   
--------------------------------------------
N                     756             609   
--------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. forval i = 0/1 {
  2.         
. // females/males only
. preserve
  3. keep if female == `i'
  4. 
. // basic regressions
. 
.         eststo clear
  5. 
.         // extensive margin
.         eststo: reg worked treat post treat_x_post, robust cluster(cpsid)
  6. 
.         // intensive margin
.         eststo: reg hrs_worked  treat post treat_x_post, robust cluster(cpsid)
  7.         
. 
. // only controlling for income  
.         local controls adjginc 
  8. 
.         // extensive margin
.         eststo: reg worked treat post treat_x_post `controls', robust cluster(cpsid)
  9. 
.         // intensive margin
.         eststo: reg hrs_worked treat post treat_x_post `controls', robust cluster(cpsid)
 10. 
.         esttab, tex se
 11.         esttab, se
 12.         
. // with all controls
.         local controls adjginc female married nchild less_hi_schl
 13. 
.         eststo clear
 14. 
.         // extensive margin
.         eststo: reg worked treat post treat_x_post `controls', robust cluster(cpsid)
 15. 
.         // intensive margin
.         eststo: reg hrs_worked treat post treat_x_post `controls', robust cluster(cpsid)
 16. 
.         esttab, tex se
 17.         esttab, se
 18.         
. restore
 19. 
. }
(208 observations deleted)

Linear regression                                      Number of obs =     548
                                                       F(  3,   274) =    0.83
                                                       Prob > F      =  0.4810
                                                       R-squared     =  0.0049
                                                       Root MSE      =  .39966

                                (Std. Err. adjusted for 275 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
      worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |  -.0291971   .0475627    -0.61   0.540    -.1228318    .0644377
        post |   .0012694   .0310241     0.04   0.967    -.0598064    .0623453
treat_x_post |  -.0395369   .0457538    -0.86   0.388    -.1296105    .0505367
       _cons |   .8248175   .0326249    25.28   0.000     .7605902    .8890449
------------------------------------------------------------------------------
(est1 stored)

Linear regression                                      Number of obs =     439
                                                       F(  3,   239) =    0.96
                                                       Prob > F      =  0.4122
                                                       R-squared     =  0.0033
                                                       Root MSE      =   13.95

                                (Std. Err. adjusted for 240 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
  hrs_worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1.348299   1.785691     0.76   0.451    -2.169405    4.866003
        post |   -.175361   1.356604    -0.13   0.897    -2.847789    2.497067
treat_x_post |   -2.07671   1.932536    -1.07   0.284     -5.88369     1.73027
       _cons |   44.99115   1.300258    34.60   0.000     42.42972    47.55258
------------------------------------------------------------------------------
(est2 stored)

Linear regression                                      Number of obs =     548
                                                       F(  4,   274) =    0.78
                                                       Prob > F      =  0.5374
                                                       R-squared     =  0.0073
                                                       Root MSE      =  .39955

                                (Std. Err. adjusted for 275 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
      worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |  -.0260919   .0471784    -0.55   0.581    -.1189701    .0667863
        post |   .0158488   .0334546     0.47   0.636    -.0500119    .0817096
treat_x_post |  -.0396238   .0455572    -0.87   0.385    -.1293103    .0500628
     adjginc |   1.91e-06   1.67e-06     1.14   0.254    -1.38e-06    5.20e-06
       _cons |   .7605794   .0638341    11.91   0.000     .6349118    .8862471
------------------------------------------------------------------------------
(est3 stored)

Linear regression                                      Number of obs =     439
                                                       F(  4,   239) =    0.74
                                                       Prob > F      =  0.5685
                                                       R-squared     =  0.0036
                                                       Root MSE      =  13.965

                                (Std. Err. adjusted for 240 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
  hrs_worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1.354269      1.788     0.76   0.450    -2.167983    4.876522
        post |  -.0225955   1.417317    -0.02   0.987    -2.814623    2.769432
treat_x_post |  -2.050799   1.944533    -1.05   0.293     -5.88141    1.779812
     adjginc |   .0000206   .0000666     0.31   0.757    -.0001106    .0001518
       _cons |   44.30222   2.491967    17.78   0.000      39.3932    49.21124
------------------------------------------------------------------------------
(est4 stored)

{
\def\sym#1{\ifmmode^{#1}\else\(^{#1}\)\fi}
\begin{tabular}{l*{4}{c}}
\hline\hline
            &\multicolumn{1}{c}{(1)}&\multicolumn{1}{c}{(2)}&\multicolumn{1}{c}{(3)}&\multicolumn{1}{c}{(4)}\\
            &\multicolumn{1}{c}{worked}&\multicolumn{1}{c}{hrs\_worked}&\multicolumn{1}{c}{worked}&\multicolumn{1}{c}{hrs\_
> worked}\\
\hline
treat       &     -0.0292         &       1.348         &     -0.0261         &       1.354         \\
            &    (0.0476)         &     (1.786)         &    (0.0472)         &     (1.788)         \\
[1em]
post        &     0.00127         &      -0.175         &      0.0158         &     -0.0226         \\
            &    (0.0310)         &     (1.357)         &    (0.0335)         &     (1.417)         \\
[1em]
treat\_x\_post&     -0.0395         &      -2.077         &     -0.0396         &      -2.051         \\
            &    (0.0458)         &     (1.933)         &    (0.0456)         &     (1.945)         \\
[1em]
adjginc     &                     &                     &  0.00000191         &   0.0000206         \\
            &                     &                     &(0.00000167)         & (0.0000666)         \\
[1em]
\_cons      &       0.825\sym{***}&       44.99\sym{***}&       0.761\sym{***}&       44.30\sym{***}\\
            &    (0.0326)         &     (1.300)         &    (0.0638)         &     (2.492)         \\
\hline
\(N\)       &         548         &         439         &         548         &         439         \\
\hline\hline
\multicolumn{5}{l}{\footnotesize Standard errors in parentheses}\\
\multicolumn{5}{l}{\footnotesize \sym{*} \(p<0.05\), \sym{**} \(p<0.01\), \sym{***} \(p<0.001\)}\\
\end{tabular}
}

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                   worked      hrs_worked          worked      hrs_worked   
----------------------------------------------------------------------------
treat             -0.0292           1.348         -0.0261           1.354   
                 (0.0476)         (1.786)        (0.0472)         (1.788)   

post              0.00127          -0.175          0.0158         -0.0226   
                 (0.0310)         (1.357)        (0.0335)         (1.417)   

treat_x_post      -0.0395          -2.077         -0.0396          -2.051   
                 (0.0458)         (1.933)        (0.0456)         (1.945)   

adjginc                                        0.00000191       0.0000206   
                                             (0.00000167)     (0.0000666)   

_cons               0.825***        44.99***        0.761***        44.30***
                 (0.0326)         (1.300)        (0.0638)         (2.492)   
----------------------------------------------------------------------------
N                     548             439             548             439   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
note: female omitted because of collinearity

Linear regression                                      Number of obs =     548
                                                       F(  7,   274) =    1.96
                                                       Prob > F      =  0.0611
                                                       R-squared     =  0.0242
                                                       Root MSE      =  .39723

                                (Std. Err. adjusted for 275 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
      worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |  -.0291161   .0466768    -0.62   0.533    -.1210069    .0627747
        post |   .0170582   .0335652     0.51   0.612    -.0490203    .0831368
treat_x_post |  -.0398753   .0458371    -0.87   0.385     -.130113    .0503625
     adjginc |   2.20e-06   1.67e-06     1.32   0.189    -1.08e-06    5.48e-06
      female |          0  (omitted)
     married |  -.1545691   .0538387    -2.87   0.004    -.2605593   -.0485789
      nchild |   .0335568   .0188899     1.78   0.077     -.003631    .0707446
less_hi_schl |  -.0231997   .0640322    -0.36   0.717    -.1492573    .1028579
       _cons |   .8379492   .0754466    11.11   0.000     .6894205     .986478
------------------------------------------------------------------------------
(est1 stored)
note: female omitted because of collinearity

Linear regression                                      Number of obs =     439
                                                       F(  7,   239) =    2.30
                                                       Prob > F      =  0.0278
                                                       R-squared     =  0.0268
                                                       Root MSE      =  13.849

                                (Std. Err. adjusted for 240 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
  hrs_worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1.561218   1.778542     0.88   0.381    -1.942402    5.064838
        post |  -.2049204   1.431035    -0.14   0.886    -3.023973    2.614132
treat_x_post |  -2.286496   1.959237    -1.17   0.244    -6.146075    1.573083
     adjginc |   1.24e-07   .0000663     0.00   0.999    -.0001304    .0001307
      female |          0  (omitted)
     married |   2.133094   1.523467     1.40   0.163    -.8680442    5.134232
      nchild |   .0490194   .7113505     0.07   0.945    -1.352298    1.450337
less_hi_schl |  -5.776067   1.651474    -3.50   0.001    -9.029371   -2.522763
       _cons |   43.80298   2.612922    16.76   0.000     38.65568    48.95028
------------------------------------------------------------------------------
(est2 stored)

{
\def\sym#1{\ifmmode^{#1}\else\(^{#1}\)\fi}
\begin{tabular}{l*{2}{c}}
\hline\hline
            &\multicolumn{1}{c}{(1)}&\multicolumn{1}{c}{(2)}\\
            &\multicolumn{1}{c}{worked}&\multicolumn{1}{c}{hrs\_worked}\\
\hline
treat       &     -0.0291         &       1.561         \\
            &    (0.0467)         &     (1.779)         \\
[1em]
post        &      0.0171         &      -0.205         \\
            &    (0.0336)         &     (1.431)         \\
[1em]
treat\_x\_post&     -0.0399         &      -2.286         \\
            &    (0.0458)         &     (1.959)         \\
[1em]
adjginc     &  0.00000220         & 0.000000124         \\
            &(0.00000167)         & (0.0000663)         \\
[1em]
female      &           0         &           0         \\
            &         (.)         &         (.)         \\
[1em]
married     &      -0.155\sym{**} &       2.133         \\
            &    (0.0538)         &     (1.523)         \\
[1em]
nchild      &      0.0336         &      0.0490         \\
            &    (0.0189)         &     (0.711)         \\
[1em]
less\_hi\_schl&     -0.0232         &      -5.776\sym{***}\\
            &    (0.0640)         &     (1.651)         \\
[1em]
\_cons      &       0.838\sym{***}&       43.80\sym{***}\\
            &    (0.0754)         &     (2.613)         \\
\hline
\(N\)       &         548         &         439         \\
\hline\hline
\multicolumn{3}{l}{\footnotesize Standard errors in parentheses}\\
\multicolumn{3}{l}{\footnotesize \sym{*} \(p<0.05\), \sym{**} \(p<0.01\), \sym{***} \(p<0.001\)}\\
\end{tabular}
}

--------------------------------------------
                      (1)             (2)   
                   worked      hrs_worked   
--------------------------------------------
treat             -0.0291           1.561   
                 (0.0467)         (1.779)   

post               0.0171          -0.205   
                 (0.0336)         (1.431)   

treat_x_post      -0.0399          -2.286   
                 (0.0458)         (1.959)   

adjginc        0.00000220     0.000000124   
             (0.00000167)     (0.0000663)   

female                  0               0   
                      (.)             (.)   

married            -0.155**         2.133   
                 (0.0538)         (1.523)   

nchild             0.0336          0.0490   
                 (0.0189)         (0.711)   

less_hi_schl      -0.0232          -5.776***
                 (0.0640)         (1.651)   

_cons               0.838***        43.80***
                 (0.0754)         (2.613)   
--------------------------------------------
N                     548             439   
--------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
(548 observations deleted)

Linear regression                                      Number of obs =     208
                                                       F(  3,   103) =    0.68
                                                       Prob > F      =  0.5659
                                                       R-squared     =  0.0148
                                                       Root MSE      =  .38729

                                (Std. Err. adjusted for 104 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
      worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .0919021   .0808633     1.14   0.258    -.0684712    .2522754
        post |   .0171717   .0486542     0.35   0.725    -.0793223    .1136658
treat_x_post |   .0020373   .0619272     0.03   0.974    -.1207807    .1248554
       _cons |   .7555556   .0648463    11.65   0.000     .6269482    .8841629
------------------------------------------------------------------------------
(est1 stored)

Linear regression                                      Number of obs =     170
                                                       F(  3,    88) =    0.54
                                                       Prob > F      =  0.6530
                                                       R-squared     =  0.0061
                                                       Root MSE      =  11.923

                                 (Std. Err. adjusted for 89 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
  hrs_worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |        1.7   3.110579     0.55   0.586    -4.481623    7.881623
        post |  -.3823529   2.037162    -0.19   0.852    -4.430784    3.666078
treat_x_post |  -1.740724    2.65139    -0.66   0.513    -7.009804    3.528356
       _cons |       40.5   2.478799    16.34   0.000     35.57391    45.42609
------------------------------------------------------------------------------
(est2 stored)

Linear regression                                      Number of obs =     208
                                                       F(  4,   103) =    0.51
                                                       Prob > F      =  0.7263
                                                       R-squared     =  0.0150
                                                       Root MSE      =  .38819

                                (Std. Err. adjusted for 104 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
      worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .0928104   .0820912     1.13   0.261    -.0699982    .2556189
        post |   .0186424   .0506674     0.37   0.714    -.0818445    .1191293
treat_x_post |   .0019674   .0619109     0.03   0.975    -.1208182    .1247531
     adjginc |   5.68e-07   3.51e-06     0.16   0.872    -6.40e-06    7.53e-06
       _cons |   .7393233   .1247893     5.92   0.000     .4918333    .9868134
------------------------------------------------------------------------------
(est3 stored)

Linear regression                                      Number of obs =     170
                                                       F(  4,    88) =    0.59
                                                       Prob > F      =  0.6743
                                                       R-squared     =  0.0109
                                                       Root MSE      =   11.93

                                 (Std. Err. adjusted for 89 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
  hrs_worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1.387482   3.172015     0.44   0.663     -4.91623    7.691194
        post |  -.7105367   2.179307    -0.33   0.745    -5.041451    3.620378
treat_x_post |   -1.56333   2.689437    -0.58   0.563     -6.90802     3.78136
     adjginc |  -.0000867   .0000941    -0.92   0.359    -.0002738    .0001003
       _cons |    43.0924   4.322856     9.97   0.000     34.50163    51.68317
------------------------------------------------------------------------------
(est4 stored)

{
\def\sym#1{\ifmmode^{#1}\else\(^{#1}\)\fi}
\begin{tabular}{l*{4}{c}}
\hline\hline
            &\multicolumn{1}{c}{(1)}&\multicolumn{1}{c}{(2)}&\multicolumn{1}{c}{(3)}&\multicolumn{1}{c}{(4)}\\
            &\multicolumn{1}{c}{worked}&\multicolumn{1}{c}{hrs\_worked}&\multicolumn{1}{c}{worked}&\multicolumn{1}{c}{hrs\_
> worked}\\
\hline
treat       &      0.0919         &       1.700         &      0.0928         &       1.387         \\
            &    (0.0809)         &     (3.111)         &    (0.0821)         &     (3.172)         \\
[1em]
post        &      0.0172         &      -0.382         &      0.0186         &      -0.711         \\
            &    (0.0487)         &     (2.037)         &    (0.0507)         &     (2.179)         \\
[1em]
treat\_x\_post&     0.00204         &      -1.741         &     0.00197         &      -1.563         \\
            &    (0.0619)         &     (2.651)         &    (0.0619)         &     (2.689)         \\
[1em]
adjginc     &                     &                     & 0.000000568         &  -0.0000867         \\
            &                     &                     &(0.00000351)         & (0.0000941)         \\
[1em]
\_cons      &       0.756\sym{***}&       40.50\sym{***}&       0.739\sym{***}&       43.09\sym{***}\\
            &    (0.0648)         &     (2.479)         &     (0.125)         &     (4.323)         \\
\hline
\(N\)       &         208         &         170         &         208         &         170         \\
\hline\hline
\multicolumn{5}{l}{\footnotesize Standard errors in parentheses}\\
\multicolumn{5}{l}{\footnotesize \sym{*} \(p<0.05\), \sym{**} \(p<0.01\), \sym{***} \(p<0.001\)}\\
\end{tabular}
}

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                   worked      hrs_worked          worked      hrs_worked   
----------------------------------------------------------------------------
treat              0.0919           1.700          0.0928           1.387   
                 (0.0809)         (3.111)        (0.0821)         (3.172)   

post               0.0172          -0.382          0.0186          -0.711   
                 (0.0487)         (2.037)        (0.0507)         (2.179)   

treat_x_post      0.00204          -1.741         0.00197          -1.563   
                 (0.0619)         (2.651)        (0.0619)         (2.689)   

adjginc                                       0.000000568      -0.0000867   
                                             (0.00000351)     (0.0000941)   

_cons               0.756***        40.50***        0.739***        43.09***
                 (0.0648)         (2.479)         (0.125)         (4.323)   
----------------------------------------------------------------------------
N                     208             170             208             170   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001
note: female omitted because of collinearity

Linear regression                                      Number of obs =     208
                                                       F(  7,   103) =    5.43
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2763
                                                       Root MSE      =  .33525

                                (Std. Err. adjusted for 104 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
      worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .0733655   .0686264     1.07   0.288    -.0627388    .2094698
        post |   .0041894   .0533833     0.08   0.938    -.1016838    .1100626
treat_x_post |   .0047669   .0655467     0.07   0.942    -.1252295    .1347633
     adjginc |  -5.71e-07   2.78e-06    -0.21   0.838    -6.08e-06    4.94e-06
      female |          0  (omitted)
     married |  -.3703243   .0950129    -3.90   0.000    -.5587599   -.1818887
      nchild |  -.0318044    .040713    -0.78   0.436     -.112549    .0489402
less_hi_schl |  -.1625393   .1171705    -1.39   0.168    -.3949193    .0698406
       _cons |    .961144   .1169268     8.22   0.000     .7292471    1.193041
------------------------------------------------------------------------------
(est1 stored)
note: female omitted because of collinearity

Linear regression                                      Number of obs =     170
                                                       F(  7,    88) =    1.02
                                                       Prob > F      =  0.4199
                                                       R-squared     =  0.0487
                                                       Root MSE      =  11.808

                                 (Std. Err. adjusted for 89 clusters in cpsid)
------------------------------------------------------------------------------
             |               Robust
  hrs_worked |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   1.250357   3.079316     0.41   0.686    -4.869138    7.369851
        post |  -.8028506   2.155783    -0.37   0.710    -5.087017    3.481316
treat_x_post |  -1.289151    2.62968    -0.49   0.625    -6.515087    3.936785
     adjginc |  -.0001148   .0000952    -1.21   0.231     -.000304    .0000744
      female |          0  (omitted)
     married |  -5.213185   3.935774    -1.32   0.189    -13.03471    2.608339
      nchild |  -.4709713   1.386164    -0.34   0.735    -3.225681    2.283738
less_hi_schl |  -2.183838   2.339858    -0.93   0.353    -6.833813    2.466137
       _cons |   45.67207   4.851951     9.41   0.000     36.02984     55.3143
------------------------------------------------------------------------------
(est2 stored)

{
\def\sym#1{\ifmmode^{#1}\else\(^{#1}\)\fi}
\begin{tabular}{l*{2}{c}}
\hline\hline
            &\multicolumn{1}{c}{(1)}&\multicolumn{1}{c}{(2)}\\
            &\multicolumn{1}{c}{worked}&\multicolumn{1}{c}{hrs\_worked}\\
\hline
treat       &      0.0734         &       1.250         \\
            &    (0.0686)         &     (3.079)         \\
[1em]
post        &     0.00419         &      -0.803         \\
            &    (0.0534)         &     (2.156)         \\
[1em]
treat\_x\_post&     0.00477         &      -1.289         \\
            &    (0.0655)         &     (2.630)         \\
[1em]
adjginc     &-0.000000571         &   -0.000115         \\
            &(0.00000278)         & (0.0000952)         \\
[1em]
female      &           0         &           0         \\
            &         (.)         &         (.)         \\
[1em]
married     &      -0.370\sym{***}&      -5.213         \\
            &    (0.0950)         &     (3.936)         \\
[1em]
nchild      &     -0.0318         &      -0.471         \\
            &    (0.0407)         &     (1.386)         \\
[1em]
less\_hi\_schl&      -0.163         &      -2.184         \\
            &     (0.117)         &     (2.340)         \\
[1em]
\_cons      &       0.961\sym{***}&       45.67\sym{***}\\
            &     (0.117)         &     (4.852)         \\
\hline
\(N\)       &         208         &         170         \\
\hline\hline
\multicolumn{3}{l}{\footnotesize Standard errors in parentheses}\\
\multicolumn{3}{l}{\footnotesize \sym{*} \(p<0.05\), \sym{**} \(p<0.01\), \sym{***} \(p<0.001\)}\\
\end{tabular}
}

--------------------------------------------
                      (1)             (2)   
                   worked      hrs_worked   
--------------------------------------------
treat              0.0734           1.250   
                 (0.0686)         (3.079)   

post              0.00419          -0.803   
                 (0.0534)         (2.156)   

treat_x_post      0.00477          -1.289   
                 (0.0655)         (2.630)   

adjginc      -0.000000571       -0.000115   
             (0.00000278)     (0.0000952)   

female                  0               0   
                      (.)             (.)   

married            -0.370***       -5.213   
                 (0.0950)         (3.936)   

nchild            -0.0318          -0.471   
                 (0.0407)         (1.386)   

less_hi_schl       -0.163          -2.184   
                  (0.117)         (2.340)   

_cons               0.961***        45.67***
                  (0.117)         (4.852)   
--------------------------------------------
N                     208             170   
--------------------------------------------
Standard errors in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. 
. cap log close
